*> Lucie Chevreuil CS280 Lab 2

IDENTIFICATION DIVISION.
PROGRAM-ID. CREDIT-CARD-BILL.
ENVIRONMENT DIVISION.
INPUT-OUTPUT SECTION.
FILE-CONTROL.
    SELECT CHARGES-FILE    ASSIGN TO "/uploads/input.txt"
        ORGANIZATION IS LINE SEQUENTIAL.
    SELECT BILL-LISTING    ASSIGN TO PRINTER
        SEQUENTIAL.
DATA DIVISION.
FILE SECTION.
FD    CHARGES-FILE.
01  CHRG-RECORD.
    02  CHRG-TYPE              PIC X.
    02  CHRG-AMOUNT             PIC 999V99.
    02  CHRG-DESC               PIC X(20).
FD    BILL-LISTING
    LABEL RECORDS ARE STANDARD
    RECORD CONTAINS 80 CHARACTERS.
01  BILL-LINE.
    02  BILL-AMOUNT         PIC ZZ9.99.
    02  FILLER              PIC X(5).
    02  BILL-DESC           PIC X(20).
    02  FILLER              PIC X(49).
WORKING-STORAGE SECTION.
01  SWITCHES.
    02  CARD-EOF-SWITCH    PIC X.
01  WORK-FIELDS.
    02  BALANCE             PIC 9999V99.
    02  TEMP                PIC 9999V99.
    02  TOTAL-CHARGES       PIC 9999V99.
01  TOTAL-REMAINING-LINE.
    02  TL-DESC             PIC X(19)   VALUE "Total Remaining = $".
    02  TL-BAL               PIC ZZZ9.99.
01  CASH-BACK              PIC 9999V99.
01  CASH-BACK-LINE.
    02  CB-DESC             PIC X(13)   VALUE "Cash back = $".
    02  CB-AMOUNT           PIC ZZZ99.99.
PROCEDURE DIVISION.
000-PRODUCE-BILL-LISTING.
    OPEN INPUT CHARGES-FILE.
    OPEN OUTPUT BILL-LISTING.
    MOVE "N" TO CARD-EOF-SWITCH.
    MOVE ZERO TO BALANCE.
    MOVE ZERO TO TOTAL-CHARGES.
    PERFORM 100-PRODUCE-BILL-LINE
        UNTIL CARD-EOF-SWITCH IS EQUAL TO "Y".
    DISPLAY "Total Charges = $" TOTAL-CHARGES.
    MOVE BALANCE TO TL-BAL.
    DISPLAY TOTAL-REMAINING-LINE.
    MOVE TOTAL-CHARGES TO CASH-BACK.
    MULTIPLY CASH-BACK BY 0.01 GIVING CASH-BACK.
    MOVE CASH-BACK TO CB-AMOUNT.
    DISPLAY CASH-BACK-LINE.
    CLOSE CHARGES-FILE.
    CLOSE BILL-LISTING.
    STOP RUN.
100-PRODUCE-BILL-LINE.
    PERFORM 110-READ-CHARGE-RECORD.
    IF CARD-EOF-SWITCH IS NOT EQUAL TO "Y"
        PERFORM 120-PRINT-BILL-LINE.
110-READ-CHARGE-RECORD.
    READ CHARGES-FILE RECORD
        AT END
            MOVE "Y" TO CARD-EOF-SWITCH.
120-PRINT-BILL-LINE.
    MOVE SPACE TO BILL-LINE.
    MOVE CHRG-AMOUNT TO BILL-AMOUNT, TEMP.
    MOVE CHRG-DESC TO BILL-DESC.
    IF CHRG-TYPE = "C" THEN
        DISPLAY "Charge  $" CHRG-AMOUNT " " CHRG-DESC
        ADD TEMP TO BALANCE
        ADD TEMP TO TOTAL-CHARGES
    ELSE
        DISPLAY "Payment $" CHRG-AMOUNT " " CHRG-DESC
        SUBTRACT TEMP FROM BALANCE
    END-IF.

